YLING-O1/DJI_RoboMaster_Motor/HLY/Inc/dvc_DJI_M2006.h
//
// Created by 34285 on 2026/6/4.
//

#ifndef MOTOR_DJI_M2006_H
#define MOTOR_DJI_M2006_H

#include "stm32f4xx_hal.h"
#include "drv_can.h"
#include "alg_PID.h"

/**
 * @brief M2006电机对应的C610电调结构体
 */
typedef struct
{
    Struct_PID PID_Angle;
    Struct_PID PID_Omega;

    Struct_CAN_Manage_Object *CAN_Manage_Object;
    Enum_RM_Motor_ID RM_Motor_ID;
    uint8_t *CAN_Tx_Data;
    float Gearbox_Rate;
    float Torque_Max;

    uint16_t Encoder_Num_Per_Round;
    uint16_t Output_Max;

    uint32_t Flag;
    uint32_t Pre_Flag;
    uint16_t Rx_Encoder;
    int16_t Rx_Omega;
    int16_t Rx_Torque;
    uint16_t Rx_Temperature;
    uint16_t Pre_Encoder;
    int32_t Total_Encoder;
    int32_t Total_Round;

    Enum_RM_Motor_Status RM_Motor_Status;
    float Now_Angle;
    float Now_Omega;
    float Now_Torque;
    uint8_t Now_Temperature;

    Enum_Control_Method Control_Method;
    float Target_Angle;
    float Target_Omega;
    float Target_Torque;
    float Out;
}Struct_RM_Motor_M2006;

void DJI_M2006_Init(CAN_HandleTypeDef *hcan, Struct_RM_Motor_M2006 *motor, Enum_RM_Motor_ID motor_id,
                    Enum_Control_Method control_method, float gearbox_rate, float torque_max);
void DJI_M2006_Output(Struct_RM_Motor_M2006 *motor);

uint16_t DJI_M2006_Get_Output_Max(Struct_RM_Motor_M2006 *motor);
Enum_RM_Motor_Status DJI_M2006_Get_CAN_Motor_Status(Struct_RM_Motor_M2006 *motor);
float DJI_M2006_Get_Now_Angle(Struct_RM_Motor_M2006 *motor);
float DJI_M2006_Get_Now_Omega(Struct_RM_Motor_M2006 *motor);
float DJI_M2006_Get_Now_Torque(Struct_RM_Motor_M2006 *motor);
uint8_t DJI_M2006_Get_Now_Temperature(Struct_RM_Motor_M2006 *motor);
Enum_Control_Method DJI_M2006_Get_Control_Method(Struct_RM_Motor_M2006 *motor);
float DJI_M2006_Get_Target_Angle(Struct_RM_Motor_M2006 *motor);
float DJI_M2006_Get_Target_Omega(Struct_RM_Motor_M2006 *motor);
float DJI_M2006_Get_Target_Torque(Struct_RM_Motor_M2006 *motor);
float DJI_M2006_Get_Out(Struct_RM_Motor_M2006 *motor);
void DJI_M2006_Set_Control_Method(Struct_RM_Motor_M2006 *motor, Enum_Control_Method control_method);
void DJI_M2006_Set_Target_Angle(Struct_RM_Motor_M2006 *motor, float target_angle);
void DJI_M2006_Set_Target_Omega(Struct_RM_Motor_M2006 *motor, float target_omega);
void DJI_M2006_Set_Target_Torque(Struct_RM_Motor_M2006 *motor, float target_torque);
void DJI_M2006_Set_Out(Struct_RM_Motor_M2006 *motor, float out);
void DJI_M2006_CAN_RxCpltCallback(Struct_RM_Motor_M2006 *motor, uint8_t *Rx_Data);
void DJI_M2006_TIM_Alive_PeriodElapsedCallback(Struct_RM_Motor_M2006 *motor);
void DJI_M2006_TIM_PID_PeriodElapsedCallback(Struct_RM_Motor_M2006 *motor);


#endif //MOTOR_DJI_M2006_H
